In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3

In [4]:
conn = sqlite3.connect('data/sakila.db')

df = pd.read_sql('SELECT * FROM rental', conn)

In [5]:
df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30.000,367,130,2005-05-26 22:04:30.000,1,2019-04-11 18:11:49
1,2,2005-05-24 22:54:33.000,1525,459,2005-05-28 19:40:33.000,1,2019-04-11 18:11:49
2,3,2005-05-24 23:03:39.000,1711,408,2005-06-01 22:12:39.000,1,2019-04-11 18:11:49
3,4,2005-05-24 23:04:41.000,2452,333,2005-06-03 01:43:41.000,2,2019-04-11 18:11:49
4,5,2005-05-24 23:05:21.000,2079,222,2005-06-02 04:33:21.000,1,2019-04-11 18:11:49

In [6]:
df.describe()

          rental_id  inventory_id   customer_id      staff_id
count  16044.000000  16044.000000  16044.000000  16044.000000
mean    8025.371478   2291.842558    297.143169      1.498878
std     4632.777249   1322.210643    172.453136      0.500014
min        1.000000      1.000000      1.000000      1.000000
25%     4013.750000   1154.000000    148.000000      1.000000
50%     8025.500000   2291.000000    296.000000      1.000000
75%    12037.250000   3433.000000    446.000000      2.000000
max    16049.000000   4581.000000    599.000000      2.000000